Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Ghost King.tmx
Source language: ko_kr
Languages: en_us

source: 촤아
en_us: slash

source: 샥
en_us: dive

source: 팀장님 소집 있으니까 6시까지 강당으로 와!
en_us: the team leader summoned everyone, so come to the auditorium at 6 PM!

source: 쾅
en_us: bam

source: 그 검법은 분명···
en_us: that sword technique…

source: 절대 그들을 얕보아서는 안돼.
en_us: you must not underestimate them.

source: 스릉
en_us: shing

source: 이놈아, 무식하게 공격만 하면 이기는 줄 아냐?
en_us: rascal, you can’t win by attacking mindlessly.

source: 쩌
en_us: fw

source: 슈욱
en_us: swoosh

source: 범 촌 기 원
en_us: baduk academy

source: 배고파서 앞도 잘 안 보이는 거 같다···
en_us: I’m so hungry that it’s affecting my vision…

source: 이게··· 눈 안깔아?!
en_us: you little…!

source: 후루룩
en_us: slurp

source: 그렇다는데용 선배님~?
en_us: you heard him, seonbae.

source: 쿠직
en_us: crunch

source: 빠 각
en_us: whabam

source: 딸피라서 아모고토 모타죠?
en_us: you can’t do anything with your low hp!

source: 휘청
en_us: sway

source: 휘오오오오
en_us: whoosh

source: 잡았나!?
en_us: did i catch it?

source: 큭
en_us: ugh

source: 척
en_us: tap

source: 넌 내가 두려운 거야!
en_us: you must be afraid of me!

source: 썸은 무슨 썸이야!
en_us: what the heck are you talking about?!

source: 아이씨, 이러면 여행경비 순식간에 없어질 텐데···
en_us: ugh, our travel expenses are gonna vanish at this rate…

source: 두웅
en_us: snicker

source: 휘릿
en_us: whirl

source: 나한테 그런 짓을 해놓고선 모르는 척할 거야?
en_us: are you really gonna act like nothing happened after what you did to me?

source: 화 아
en_us: flare

source: 저리 꺼져···
en_us: get lost…

source: 태, 태연아ꞏꞏꞏ!
en_us: t-taeyeon...!

source: 피식
en_us: smirk

source: 쭈욱
en_us: stretch

source: 벌컥
en_us: slurp

source: 한 개···
en_us: one pill…

source: 화{j}악
en_us: whoosh

source: 탓
en_us: leap

source: 갈!
en_us: you moron!

source: 으악
en_us: ugh

source: 그렇다면 흉수도 마샴바와 깊이 관련되어 있다는 소리일 터.
en_us: that would mean that the criminal and mashamba are connected.

source: 흥, 자만하지 마시오.
en_us: hmph, don’t be so full of yourself.

source: 투투투
en_us: thunk thunk thunk

source: 번뜩
en_us: flash

source: 빠
en_us: sm

source: 설렁탕
en_us: ox bone soup

source: 아가리 꽉 물어라ꞏꞏꞏ
en_us: hold on tight...

source: 호, 혹시?!
en_us: c-could it be?!

source: 꽉
en_us: tug

source: 마샴바의 숨결···!
en_us: mashamba’s breathing…!

source: 퍽
en_us: fwoosh

source: 결국 아버지에게서 회수한 거냐?
en_us: so you ended up taking it from your father?

source: 저벅
en_us: step

source: 그럼 여기 있는 모든 쓰레기를 한꺼번에 모으면 되는 건가?!
en_us: so will it work if i gather all the trash here into one clump?!

source: 뭐해요, 다 도망가잖아요!
en_us: what are you doing? they’re getting away!

source: ㅂㄷ
en_us: tremble

source: 슈슈슉
en_us: scoot

source: 커, 어억ꞏꞏꞏ
en_us: u-ugh...

source: 시익
en_us: smile

source: 짓궃은 남자ꞏꞏꞏ
en_us: you naughty boy...

source: 흑사맹주
en_us: master of the black death sect

source: 얌전한 듯 드세다고 할까···
en_us: she’s gentle, but tough…

source: 더군다나 그런 공격이 숨돌릴 틈 없이 몰아치지ꞏꞏꞏ
en_us: besides, he attacks without giving his opponent a chance to catch their breath...

source: 그 상태로 밥이 잘도 넘어가는군.
en_us: I’m surprised you can eat in that state.

source: 투학
en_us: fwoosh

source: 쿠우우우
en_us: blaze

source: 비령문 강태연 · 조회수 5.2천회
en_us: hidden spirit sect taeyeon kang · 5.2K views

source: 어쩔 수 없나ꞏꞏꞏ
en_us: I guess I don’t have any choice...

source: 손고후 박진석
en_us: gohoo son jinseok park

source: 병실이란 말이지···
en_us: the ward, huh…

source: 뻐억
en_us: wham

source: 전 아빠에 대해 아는 게 너무 없어서ꞏꞏꞏ
en_us: I barely know anything about him...

source: 차악
en_us: thump

source: ㅎㅎ X끼, 한방 비스무리 먹인 거에 들떠가지곤ꞏꞏꞏ
en_us: haha, look at you getting all excited after barely landing one attack...

source: 어ꞏꞏꞏ?
en_us: huh...?

source: 흐음
en_us: hmm

source: 쟤가 태연이에요 아버지.
en_us: father, that’s taeyeon.

source: 헤헤
en_us: hehe

source: 누가 누굴 걱정해?
en_us: who’s worried about who?

source: 심 일 인 쇄 사
en_us: simil printing service

source: 놈을 움직이지 못하게 할 방법을 찾아야 해!
en_us: I need to find a way to stop him from moving!

source: 거기 예쁜이들, 빨리 여길 뜨라고,
en_us: hello there, pretty ladies. you should get out of here as fast as you can.

source: 츠츠츠츠
en_us: whish

source: 이게 대체 어떻게 된 거지?
en_us: what the heck happened here?

source: 그딴거 필요없어.
en_us: you don’t need any of that garbage.

source: 이상한 일이군.
en_us: how strange.

source: 아무리 강한 힘이라도 내 스스로 제어할 수 없다면,
en_us: no matter how strong I am,

source: 화악
en_us: woah

source: 미안하구나.
en_us: ...I’m sorry.

source: 봉평해장국
en_us: bongpyeong-style hangover soup

source: 부문주님의 분부대로 연구를 진행한 결과 흡성대법의 효능과 99% 일치했습니다.
en_us: according to our results, it’s 99% as effective as the fundamental qi absorption technique.

source: 그 때의 내가 아냐!
en_us: ...the person I was before either!

source: 뚜-
en_us: beep

source: 훙
en_us: fwoosh

source: 우웅
en_us: hummm

source: 흠ꞏꞏꞏ
en_us: hmm...

source: 뭐지, 금강불괴의 사장님이 밀려났다고?
en_us: what was that? did he just push our indestructible president back?

source: 호, 혹시 만무지체인가?
en_us: d-does he have the perfect body for martial arts?

source: 라면 또 먹고싶다.
en_us: I wanna eat more instant noodles.

source: 파박
en_us: smack

source: 콰아
en_us: roar

source: 아우 씨, ㅈ나 아프네 진짜ꞏꞏꞏ
en_us: ugh, that hurts so f*cking bad...

source: 콰앙
en_us: kaboom

source: 오{j}싹
en_us: shiver

source: 소리만 꽥꽥 지르면 더 세지는 줄 아니?
en_us: does he think he’ll get stronger just by shouting louder?

source: 후두둑
en_us: clang

source: 탁
en_us: tap

source: 싹 다 집합시켜, 계획을 앞당긴다!
en_us: get everyone together. we’re proceeding with the plan!

source: 천한 놈이···
en_us: you lowborn bastard…

source: 깨어나라!
en_us: wake up!

source: 오싹
en_us: shiver

source: 속도는 나쁘지 않은데···
en_us: his speed isn’t bad…

source: 사장님!!
en_us: president!

source: 슈웃
en_us: swoosh

source: 홱
en_us: jerk

source: 반짝
en_us: sparkle

source: 피했다고 생각했을 땐 이미 다른각도에서 공격이 들어와!
en_us: just when i think i’ve dodged an attack, i get hit from a completely different angle!

source: 슉
en_us: WHISH

source: 키우우우
en_us: flash

source: 번쩍
en_us: flash

source: 병원
en_us: hospital

source: 사장님께서 이미 알고계신 인물입니다.
en_us: it’s someone you know, sir.

source: 딸깍
en_us: click

source: 흠
en_us: hmm

source: 우씨
en_us: dammit

source: 씨익
en_us: smirk

source: 번 뜩
en_us: blink

source: 아, 아버···
en_us: f-father…

source: 뒤적
en_us: fumble

source: 팟
en_us: flash

source: 슥
en_us: glance

source: 쫘악
en_us: fwoosh

source: 두려워해라, 대막의 쌍룡 토르카를!
en_us: fear me, the double dragon of daemak!

source: 이자들은 대체···?
en_us: who are they…?

source: 아버지!!
en_us: father!!!

source: 김보아, 학우는 어디 갔지?
en_us: bo-a, where’s hak-u?

source: 타다닷
en_us: dash

source: 웅
en_us: un

source: 토르카, 법왕님 앞에서 무슨 말버릇이냐.
en_us: torka, what are you saying in front of the king?

source: 얼마 전에 구월단 ㅅ끼들 단체로 빵 갔잖아?
en_us: remember how a big group of those ancient moon squad bastards went to the slammer a while back?

source: 쿠우우
en_us: loom

source: 개ㅅ끼야 니 땜에 내기 졌잖아.
en_us: you made me lose the bet, you son of a b*tch.

source: 수북
en_us: heap

source: 강태연은 어때?
en_us: what about taeyeon kang?

source: 이놈은 네 아비이기 이전에 주화입마에 빠져 수많은 무림인들을 상하게 한 자다.
en_us: this man is someone who hurt many martial artists because he couldn’t control his qi before he is your father.

source: 둘.이.서.
en_us: to. you. both.

source: 령.
en_us: spirit

source: 조금 더···!
en_us: just a little more…!

source: 지끈
en_us: twitch

source: ※대막 :
en_us: ※daemak:

source: 하악
en_us: haa

source: 죄송합니다.
en_us: I’m sorry.

source: 불쌍하게도 당신의 장난감에서 태어난···
en_us: you mean, a lowborn bastard who had the misfortune…

source: ㅈ랄마!!
en_us: stop with the bullsh*t!

source: 큭큭
en_us: hehe

source: 산 회 음 · 파
en_us: mountain echo

source: 아가···
en_us: my baby…

source: 맛있겠다···
en_us: he looks yummy…

source: 둥
en_us: da dun

source: 오!
en_us: oh!

source: 엉
en_us: oosh

source: 고오
en_us: loom

source: 쿵
en_us: bam

source: 크아!
en_us: argh!

source: 경험이 없으면 눈치라도 빨라야 하는데ꞏꞏꞏ
en_us: if you lack experience, you should make up for it with quick wits...

source: 치익!
en_us: tsk!

source: 본좌의 장난감을 건든 대가는 호되게 치를 거라고!
en_us: tell him he’ll pay for messing with his master’s plaything!

source: 헥
en_us: huff

source: 각
en_us: ack

source: 벌을 받아야겠지?
en_us: so you won’t forget about this day?

source: 붕
en_us: swoosh

source: 쿠드드
en_us: clench

source: 커억!
en_us: argh!

source: 덜덜덜
en_us: tremble

source: 이딴 건 무경대 MT 가서 장기자랑할 때나 보여주고ꞏꞏꞏ
en_us: save that sh*t for your university talent show...

source: 콱
en_us: twist

source: 그거다.
en_us: that’s it.

source: 이미 타락한 마샴바는 소년의 혼에 완전히 빙의된 상태다.
en_us: the fallen mashamba has already completely taken over the boy’s soul.

source: 크윽
en_us: ugh

source: 귀령에 홀린 놈들을 구제할 뿐이야.
en_us: all i’m doing is rescuing people under the spell of the ghost king.

source: 버그인가?
en_us: is it a glitch?

source: 그러니까ꞏꞏꞏ
en_us: that would be me...

source: 타닷
en_us: dash

source: 그나저나 저 여자, 무경대 학생이었다니···
en_us: anyway, i can’t believe that girl goes to mpu…

source: 괜히 선배한테 오해만 샀잖아!
en_us: seonbae’s going to get the wrong idea!

source: 그래 그래, 너 근성 하나는 나도 인정하는데ꞏꞏꞏ
en_us: yeah, yeah. you have guts, i’ll give you that, but...

source: 행여나 조우하게 된다면···
en_us: but if you ever encounter them…

source: 헉
en_us: huff

source: 재밌는 걸 하려 길래 보고 있었는데···
en_us: I was watching you because it looked like you were doing something interesting…

source: 귀령의 기운이 빨려나가···
en_us: the ghost king’s energy is being sucked out of me…

source: 술렁
en_us: bathump

source: 그 다음은ꞏꞏꞏ
en_us: and after that...

source: 초면에 다짜고짜 '넌 뭐야'?
en_us: did she really just ask me that? we just met!

source: 슈우우
en_us: swoosh

source: 우리 아빠 알아요?
en_us: do you know my dad?

source: 슈슈슈
en_us: swish

source: 하지만ꞏꞏꞏ
en_us: but...

source: 타탁
en_us: tap tap

source: 내.꺼.
en_us: that’s. mine.

source: 귀령파 한번 보여주는게 그렇게 힘드냐?
en_us: is it really that hard to show me the ghostly spirit wave?

source: 우걱 우걱
en_us: munch munch

source: 준비해라 토르카.
en_us: get ready, torka.

source: 끄아아아악!!
en_us: arghhh!!!

source: 장학우
en_us: hak-u jang

source: 귀령의 힘이 육체의 주도권을 침식해가니 말 다했지···
en_us: it’s obvious, seeing that the ghost king’s powers are eating away at his energy…

source: 기획/제작 제이팀
en_us: planning/production by jteam

source: 보내준다고 할 때 곱게 갈 것이지 왜 매를 버냐?
en_us: you should’ve left when i gave you the chance. are you asking for a beating?

source: 부릅
en_us: glare

source: 오늘까지 이걸 다 치워야 하는데 어쩌면 좋나ꞏꞏꞏ
en_us: how ever will i clean all of this up by today...?

source: 유지호, 네가 나선화와 강태연을 맡아라.
en_us: jiho, you’ll be in charge of both seonhwa and taeyeon.

source: 휘적
en_us: twirl

source: 팔락
en_us: flip

source: 다, 다행이다.
en_us: wh-what a relief.

source: 됐다!
en_us: it worked!

source: 츠츠츳
en_us: swoosh

source: 어디, 반대쪽도 한번ꞏꞏꞏ!
en_us: let’s take a look at the other side too...!

source: ···라고 하였습니다.
en_us: that is what he said…

source: 쿠웅
en_us: thump

source: 강태연이 귀령왕의 후인···
en_us: taeyeon is the descendant of the ghost king…

source: 왔냐?
en_us: you’re here.

source: 흥.
en_us: hmph.

source: 타앗
en_us: dash

source: 투닥
en_us: scuffle

source: 빡
en_us: bonk

source: 버둥
en_us: wriggle

source: 뜨끈
en_us: steam

source: 배의 외상이 생각보다 깊다.
en_us: the wound in my abdomen is deeper than I thought.

source: 너, 귀령인지 뭔지보다 빨리 지호 선배한테 가서 해명해!
en_us: you! go explain yourself to jiho seonbae instead of prattling on about that ghost king or whatever it is!

source: 콰
en_us: wh

source: 꾸벅
en_us: nod

source: 빠악
en_us: whack

source: 하
en_us: ha

source: 쉭
en_us: slash

source: 역시 라면은 이렇게 먹어야지!
en_us: now this is how you’re supposed to eat instant noodles!

source: 한 세대에 귀령이 둘이나 있을 순 없는 노릇인데···
en_us: there can’t be two ghost kings in one generation…

source: 부들
en_us: tremble

source: 홍 툰
en_us: hong toon

source: 내 고기~~!
en_us: my meat!

source: 파앗
en_us: rustle

source: 몸아파서 못나갑니다.
en_us: I can’t go because I’m sick.

source: 벅
en_us: grip

source: 비틀
en_us: stagger

source: 씩
en_us: smirk

source: 휘릭
en_us: whoosh

source: 쫄보?
en_us: ...you just call me a coward?

source: 하하
en_us: haha

source: 이런 식이면 실전에서도 아주 유용하죠!
en_us: this method is very useful in battle!

source: 음.
en_us: hmm.

source: 그런 수준은 실로 놀라웠습니다.
en_us: I was quite impressed.

source: 꺄윽···!
en_us: argh…!

source: 이, 일단 가만히 있어야겠다.
en_us: I-I should just keep my mouth shut for now.

source: 살수문 놈들이 쳐들어 왔습니다!!
en_us: the bastards from the assassin sect are here!

source: 혹시 자네가?
en_us: you?

source: 부 릅
en_us: rumble

source: 콰콰콰콰콰
en_us: wham wham wham bam

source: 무림 제일 무당파의 정의가 뭐가 되겠느냐!
en_us: what would become of the justice of the wudang sect, the greatest sect in all of murim?

source: 어머, 얘가 왜 이리 까칠하니?
en_us: oh my, why are you so on edge?

source: 말귀를 못 알아 처먹나?
en_us: how can i get it into your thick skull?

source: 법왕님께서 주의하란 이유가 이런 것이었나···!
en_us: this is why the king told us to be careful…!

source: 추 욱
en_us: droop

source: 행복해라···
en_us: please be happy…

source: 하하, 그렇게 성질이 급해서 쓰겠는가?!
en_us: haha, you should tone down that temper of yours!

source: 착
en_us: thump

source: 여긴 나 '토르카'에게 맡겨주시길!
en_us: leave it to me, torka!

source: 죄, 죄송해요 팀장님~
en_us: I-I’m sorry, team leader!

source: 살···
en_us: mur…

source: 빠직
en_us: annoyed

source: 죽어.
en_us: die.

source: 잠깐.
en_us: hang on.

source: 쉬 이
en_us: sw

source: 아, 아 네.
en_us: ah, yes.

source: 곧 돌아오겠소.
en_us: I’ll be back soon.

source: 죽어라.
en_us: die.

source: 쿠아아아
en_us: fwoom

source: 본교의 가르침을 어겨선 안 되지.
en_us: I shouldn’t go against our school’s teachings.

source: 두리번
en_us: fwip

source: 분하겠지만 이건 그대가 끼어들만한 싸움이 아니오.
en_us: i know you’re upset, but this isn’t a fight you can intervene in.

source: 흑사우주'의 공격을ꞏꞏꞏ
en_us: he managed...

source: 사람 궁금하게 해놓고 왜 그냥 가요?!
en_us: are you really gonna walk away after getting me curious?!

source: 무림인이면 어쩔꺼야···
en_us: so what if he is a murimist…?

source: 나, 얘랑 할래요.
en_us: I wanna pair up with him.

source: 하, 학생 괜찮어···?
en_us: hey, kid, are you okay…?

source: 이기적~!
en_us: gijeok!

source: 즉, 흑마서는 두 권이란 말이다.
en_us: that means there must be two volumes of the black demon book.

source: 나랑 한번 해보시겠다?
en_us: you really wanna try me, huh?

source: 뚝
en_us: drip

source: 고기~~!!
en_us: food!

source: 뭐, 주차장?
en_us: the parking lot?

source: 이건···?!
en_us: is this…?!

source: 또 다시 같은 역사를 반복하지 않도록,
en_us: to prevent history from repeating itself,

source: 상대가 강하다면 한발 물러서서 흐름을 파악해야지!
en_us: if your opponent is powerful, you need to step back and gauge the flow of the battle!

source: 내 친구를 밟고 서있으면 내가 귀령파를 진심으로 쏠 수 있겠냐?
en_us: how can I use the ghostly spirit wave when you’re standing on my friend?

source: 그때까지 잘 생각해 봐.
en_us: keep thinking about it until i get back.

source: 안됩니다!
en_us: no!

source: 칫
en_us: tsk

source: 투투투투
en_us: thunk thunk thunk

source: 전륜법왕은 깨달음을 얻기 위해 천하를 주유하며 천하의 강자들을 상대하였는데
en_us: in order to attain enlightenment, the king of the revolution palace traveled the world to fight the strongest people under the sky.

source: 또각
en_us: tp

source: 쿠{j}웅
en_us: thump

source: 크으윽
en_us: guhhh

source: 대막이라면 설마 새외사궁 중 전륜법궁의 세력 말하는 건가?
en_us: does she mean the revolution palace, one of the sects in the outer nations of murim?

source: 혈 폭 공!!
en_us: explosive blood arts!!!

source: 네?!
en_us: excuse me?!

source: 귀 령 왕
en_us: ghost king

source: 터벅
en_us: step

source: 흑사맹 총단 사옥
en_us: black death sect company building

source: 네놈도 살인마의 길을 걸을 거냐?
en_us: do you want to become a murderer too?

source: 어, 어디긴요 병실이지ㅎㅎ
en_us: o-of course I’m in the ward, hehe.

source: 지호 선배!!
en_us: jiho seonbae!!!

source: 절래 절래
en_us: shake shake

source: 사건은 또 다시 미궁으로
en_us: this case is once again a mystery.

source: 누, 누구ꞏꞏꞏ
en_us: wh-who...

source: 당신이 그렇게 아끼던 큰 아들내미···
en_us: your firstborn, who you doted on so much…

source: 범인··· 무경단의 입장은?
en_us: suspect… what is the murim patrol squad’s stance?

source: PC방
en_us: internet cafe

source: 알겠습니다.
en_us: yes, sir.

source: 덜컹
en_us: slam

source: 말 안 듣는 놈은 매가 약이지!
en_us: brats who won’t listen need a good beating!

source: 그 빗자루로 반격이라도 한 번 해보지그래?
en_us: why don’t you try fighting back with that broom?

source: 전륜법왕의 심득의 기록을 맡은 제자 중 하나였다.
en_us: ...in the dark shadow of the heavenly prajna arts, the martial arts style created by the king.

source: 쿠지직
en_us: grind

source: 처억
en_us: gleam

source: 그래서 난 무경대에 온 거다.
en_us: that’s why I came to mpu.

source: 마샴바의 손톱이다!
en_us: it’s mashamba’s claws, all right!

source: 스윽
en_us: wipe

source: 쿵 쿵
en_us: wham wham

source: 선배, 저 진짜 억울해ꞏꞏꞏ
en_us: seonbae, this is a misunderstanding...

source: 차라리 혼자서 잡고 말지···
en_us: I’ll just catch them myself…

source: 웃!
en_us: ugh!

source: 콰드득
en_us: crack

source: 강태연!
en_us: taeyeon kang!

source: 빠아
en_us: smash

source: 짐작 가는 게 있으십니까?
en_us: any guesses?

source: 슈웅
en_us: swish

source: 아버지!
en_us: father?!

source: 은혜는 ㅈ랄···
en_us: what a load of bullsh*t…

source: 다 뒤져가는 게 어디서 가오를 잡아?!
en_us: you shouldn’t act so cocky with one foot in the grave!

source: 뭔소리야?!
en_us: what the heck are you saying?!

source: 아, 그래ꞏꞏꞏ?
en_us: oh, is that how it is...?

source: 미동도 없어···?
en_us: he didn’t even budge…?

source: 전부 피했어?
en_us: to dodge all of the attacks?

source: 하루빨리 돌아가고 싶을 정도다···
en_us: it makes me want to go back home as soon as possible…

source: 여기는 무경단이야.
en_us: this is the murim patrol squad.

source: 쩌억
en_us: shatter

source: 슉슉
en_us: shwoo

source: 어딜···
en_us: how dare you…

source: 분명히 이쪽으로 갔는데···
en_us: I could’ve sworn they went this way…

source: 귀령의 기운이 사그라들었잖아?
en_us: the ghost king’s energy is subsiding?

source: 이런 걸 전화위복이라 하던가?
en_us: isn’t this what they call a blessing in disguise?

source: 조금만 더 강했더라면 기적이 다리도···
en_us: if I had just been a little stronger, gijeok’s leg wouldn’t be…

source: 크어억···!
en_us: argh…!

source: ㅈ만한 게 어디서 감히ꞏꞏꞏ!
en_us: you little...! how dare you...!

source: 용의자는 십중팔구 무림인이다.
en_us: it’s highly likely that the suspect is a martial artist.

source: 아
en_us: ah

source: 대사형한테 무슨 말버릇이냐!
en_us: how dare you speak to your senior that way!

source: 너, 너는···
en_us: y-you’re…

source: 불쑥
en_us: shwoo

source: 하아
en_us: sigh

source: 삭
en_us: whish

source: 고오오
en_us: loom

source: 썩
en_us: grab

source: 아휴
en_us: sigh

source: 쉬 이{j}익
en_us: swoosh

source: 콰악
en_us: clench

source: 휙
en_us: swish

source: 나와 대결을 하겠다는 그대의 약조는 언제 지켜줄 것인가?
en_us: ...to have a match with me after you’d absorbed the ghost king from your father?

source: 어머 미안.
en_us: oh, dear.

source: 촤촤촷
en_us: swish swish swish

source: 살아남을게···
en_us: I’ll survive…

source: 욱씬
en_us: throb

source: 그 무모함이 어떤 결과를 가져올지 감당 못하면서 말이야!
en_us: when they can’t handle the consequences of their recklessness!

source: 쿠앙
en_us: whabam

source: 그 자세에서 튀어 올라 치명타를 피했다는 건가!
en_us: he jumped from that position to avoid that fatal blow?!

source: 역시, 이렇게 무식하게 모으는 방법은ꞏꞏꞏ
en_us: i knew it. my qi’s too weak...

source: 쿠드드드
en_us: gash

source: 아버지는 만났냐?
en_us: have you met your father?

source: 아 진짜, 어떡하지ꞏꞏꞏ!
en_us: seriously, what am I gonna do now...?

source: 슥슥
en_us: hehe

source: 그래.
en_us: yes.

source: 더듬
en_us: touch

source: 내 아들을 구해줘서ꞏꞏꞏ
en_us: thank you...

source: 꼬르륵
en_us: growl

source: 나의 화산을 만드는 것이 목표였다.
en_us: my goal after i became the leader was to remake the flower mountain.

source: 도대체 어땠길래 그런 전설이 되었을까?'
en_us: ...because i was curious how powerful he was

source: 활{j}짝
en_us: be{j}am

source: 그러니까 신도들의 기강이 그 꼴이 아니냐!
en_us: this is why the devotees are so undisciplined!

source: 이런···!
en_us: crap…

source: 날 즐겁게 해줬으니까 그냥 보내주지.
en_us: I’ll let you go since you’ve entertained me.

source: 그렇다고 나보다 약한 애 밑에서 지내긴 싫은데···
en_us: even if that’s true, I don’t wanna be under someone weaker than me…

source: 퍼버벅
en_us: smack

source: 흥
en_us: hmph

source: 소속문파
en_us: affiliated sect

source: 지지표화
en_us: finger whirlwind flower

source: 결국 무공이랑 힘과 맷집이 다야.
en_us: martial arts is all about power and endurance.

source: 네깟 놈의 그런 공격으론 사장님의 금강불괴를 뚫을 수 없다.
en_us: he can’t take the president down with attacks like that.

source: 나참
en_us: jeez

source: 1100원
en_us: 1100 won*

source: 그런··· 말도 안되는···
en_us: what… kind of nonsense is that…?

source: 투콰
en_us: swish

source: 흥~
en_us: hmm.

source: 혹시 먹방 찍으시나ㅎㅎ
en_us: are you filming a mukbang or something? hehe.

source: 결국 그 어미에 그 자식,
en_us: like mother, like son.

source: 크아아아악!
en_us: arghhh!!!

source: 빠{j}각
en_us: whack

source: 그걸 나이프 하나로 버텼다고?
en_us: he held out against that with a knife?

source: 딸랑
en_us: jingle

source: 멀 찍
en_us: far

source: 야, 너희들 뭐하는거야!
en_us: hey, what are you three doing?!

source: 후두두
en_us: splatter

source: 그 구령옥, 지금 빼려고 했지?
en_us: you were trying to remove the ghost jade just now, weren’t you?

source: 늦었군···
en_us: you’re late…

source: 이거, 정말 일반인들 사이에서 벌어진 사건인가요?
en_us: was this really a fight that broke out between civilians?

source: 이미 다섯 대나 때렸잖아.
en_us: ...that I’ve already hit you five times.

source: 네가 타고난 힘 아니더냐.
en_us: this is your innate power.

source: 터엉
en_us: fwoosh

source: 투뿔(1++)!!
en_us: prime beef!!

source: 휴대전화
en_us: mobile

source: 박진석
en_us: jinseok park

source: 스르륵
en_us: swoosh

source: 내가 생각해도 어이가 없다.
en_us: even i think it makes zero sense.

source: 지호양.
en_us: miss jiho.

source: 이런 데서 마샴바의 무공을 익힌 놈을 찾을 수 있을까?
en_us: but can we really find the one who learned mashamba’s martial arts this way?

source: 휘이이이
en_us: whoosh

source: 아버지의 속죄를 왜 네가 하고있냐는 말이야.
en_us: why are you atoning for your father’s sins?

source: 재밌는 사실 하나 알려줄까?
en_us: do you wanna know something funny?

source: 그러니까 그런거 모른다고 했잖아!
en_us: like i said, i have no idea what you’re talking about!

source: 그, 그러면 그냥 아무 이유 없이 재미로 이런 짓을 했다는 건가요?
en_us: a-are you saying the murderer did this purely for their own entertainment?

source: 후웅
en_us: whoosh

source: 툭툭
en_us: thump thump

source: 버럭
en_us: yell

source: 특징?
en_us: distinguishable traits?

source: 인정할게, 너 ㅈ나 쎄다ꞏꞏꞏ
en_us: I’ll admit that you’re f*cking strong...

source: 중원의 무공따위, 어차피 전륜법왕님께 모두 패한 무공 아닙니까!
en_us: aren’t they all people you once defeated, my king?

source: 이제 느껴져, 너의 움직임ꞏꞏꞏ
en_us: I can feel your movements now...

source: 흑사맹 사대호법
en_us: four great guardians of the black death sect

source: 형···님···
en_us: hyeong…

source: 드디어ꞏꞏꞏ
en_us: finally...

source: 할아버지ꞏꞏꞏ
en_us: grandpa...

source: 아이씨, 대체 뭐야 그 여자는ꞏꞏꞏ
en_us: darn it, who was that woman...?

source: 화산의 가르침을!
en_us: ...that we forgot the teachings of the flower mountain!

source: 음?
en_us: hmm?

source: 무기는 죄가 없다.
en_us: weapons have no sin.

source: 미, 미안 나 잠깐만···
en_us: I-I’m sorry, give me a second…

source: 낭 안
en_us: wolf eyes

source: 내가 제어할 수 있게 가르쳐줄까?
en_us: ...how to control the ghost king’s energy?

source: 야.
en_us: hey.

source: 쉬익
en_us: smirk

source: 더···
en_us: more…

source: 다음날
en_us: the next day

source: 콰아아아아
en_us: shaaa

source: 그림
en_us: art by

source: 쯧쯧, 눈으로만 보려고 하니까 안되는 거지.
en_us: tsk tsk, that’s because you’re only using your eyes.

source: 징
en_us: sob

source: 이제서야 연락을 하시다니,
en_us: so you’re calling me at last.

source: ㅋ
en_us: heh

source: 헌데···
en_us: however…

source: 파아
en_us: whabam

source: 나는 그냥 하나만 확인하면 돼.
en_us: I just wanted to confirm something.

source: 어디 황금고블린 한 마리 안 지나가냐?
en_us: isn’t there a conveniently loaded, sitting duck somewhere?

source: 뭐?
en_us: what?

source: 알려줘서 고맙다!
en_us: thanks for the pointer!

source: 아무리 답답한 그라도 이번만큼은 나를 반드시 처분하려고 할 거다.
en_us: ...he’ll definitely get rid of me no matter how much of a stickler for the rules he is.

source: 마샴바···!
en_us: mashamba…!

source: 아, 네ꞏꞏꞏ
en_us: ah, of course...

source: 예, 하지만 그 자의 특징을 어느 정도 파악했으니 곧 확인할 수 있을 거라 봅니다.
en_us: yes. however, since we know his distinguishable traits to some extent, I’m sure we’ll be able to confirm his identity soon.

source: 아버지를 찾는 것.
en_us: ...is to find my father.

source: 드드드드
en_us: rumble

source: 기획/제작
en_us: planning/production by

source: 쿠르르르
en_us: whoosh

source: 사장님의 손마디에 걸리면 웬만한 철도 갈가리 찢어버린다.
en_us: the president can easily tear iron into pieces.

source: 아악 진짜 죽을 뻔 했잖아!
en_us: ah, I almost died for real!

source: 강태연, 어째서 그놈이···
en_us: taeyeon kang, how did he…

source: 크윽ꞏꞏꞏ
en_us: ugh...

source: 몸매가 완전 내 스타일이야.
en_us: your body is just my type.

source: 도리
en_us: shake

source: 꼴에 지 어미라고 감싸는 거냐?
en_us: you’re standing up for your mother in this pathetic state?

source: 걔는 내버려 둬 이 비열한 쫄보 X끼야!
en_us: leave him alone, you f*cking coward!

source: 그대들도 조심하는 게 좋을 거다.
en_us: you all had best be careful.
